In [0]:
import pandas as pd
import numpy as np

In [0]:
df=pd.DataFrame([[1,3,np.nan],[np.nan,4,5],[5,6,7]])
df

     0  1    2
0  1.0  3  NaN
1  NaN  4  5.0
2  5.0  6  7.0

In [0]:
df.dropna()

     0  1    2
2  5.0  6  7.0

In [0]:
df

     0  1    2
0  1.0  3  NaN
1  NaN  4  5.0
2  5.0  6  7.0

In [0]:
df.dropna(axis=1)

   1
0  3
1  4
2  6

In [0]:
#row
df.dropna(axis=0)

     0  1    2
2  5.0  6  7.0

In [0]:
df.dropna(axis=1,how='all')

     0  1    2
0  1.0  3  NaN
1  NaN  4  5.0
2  5.0  6  7.0

In [0]:
#minimum nan
df.dropna(axis='rows', thresh=3)

     0  1    2
2  5.0  6  7.0

In [0]:
df.fillna(method='ffill')

     0  1    2
0  1.0  3  NaN
1  1.0  4  5.0
2  5.0  6  7.0

In [0]:
df.fillna(method='bfill')

     0  1    2
0  1.0  3  5.0
1  5.0  4  5.0
2  5.0  6  7.0

In [0]:
df1=pd.read_csv("G:/r_data/miss.csv")
df1.head()

   weight  length species
0    23.0    23.0   ilish
1    34.0     NaN   pabda
2    45.0    67.0     roi
3    56.0    89.0     NaN
4     NaN   111.0   pabda

In [0]:
df1.fillna(method='ffill')

    weight  length species
0     23.0    23.0   ilish
1     34.0    23.0   pabda
2     45.0    67.0     roi
3     56.0    89.0     roi
4     56.0   111.0   pabda
5     78.0   133.0   pabda
6     89.0   155.0     roi
7    100.0   177.0     roi
8    111.0   177.0     roi
9    122.0   221.0   ilish
10   122.0   243.0   ilish
11   144.0   243.0   ilish
12   155.0   287.0   pabda
13   166.0   309.0   pabda
14   166.0   331.0   pabda
15   188.0   353.0   pabda
16   199.0   353.0   pabda
17   210.0   397.0     roi
18   221.0   419.0     roi

In [0]:
df1.fillna(method='bfill')

    weight  length species
0     23.0    23.0   ilish
1     34.0    67.0   pabda
2     45.0    67.0     roi
3     56.0    89.0   pabda
4     78.0   111.0   pabda
5     78.0   133.0     roi
6     89.0   155.0     roi
7    100.0   177.0   ilish
8    111.0   221.0   ilish
9    122.0   221.0   ilish
10   144.0   243.0   ilish
11   144.0   287.0   ilish
12   155.0   287.0   pabda
13   166.0   309.0   pabda
14   188.0   331.0   pabda
15   188.0   353.0   pabda
16   199.0   397.0     roi
17   210.0   397.0     roi
18   221.0   419.0     roi

In [0]:
df1.fillna(method='ffill',axis='rows')

    weight  length species
0     23.0    23.0   ilish
1     34.0    23.0   pabda
2     45.0    67.0     roi
3     56.0    89.0     roi
4     56.0   111.0   pabda
5     78.0   133.0   pabda
6     89.0   155.0     roi
7    100.0   177.0     roi
8    111.0   177.0     roi
9    122.0   221.0   ilish
10   122.0   243.0   ilish
11   144.0   243.0   ilish
12   155.0   287.0   pabda
13   166.0   309.0   pabda
14   166.0   331.0   pabda
15   188.0   353.0   pabda
16   199.0   353.0   pabda
17   210.0   397.0     roi
18   221.0   419.0     roi

In [0]:
df1=pd.DataFrame({"employee":["hafez","jabed","babe"],"group":["it","com","acc"]})
df1

  employee group
0    hafez    it
1    jabed   com
2     babe   acc

In [0]:
df2 = pd.DataFrame({'employee': ["hafez","jabed","babe"],
                    'hire_date': [2004, 2008, 2012]})
df2

  employee  hire_date
0    hafez       2004
1    jabed       2008
2     babe       2012

In [0]:
pd.merge(df1,df2)

  employee group  hire_date
0    hafez    it       2004
1    jabed   com       2008
2     babe   acc       2012

In [0]:
df4 = pd.DataFrame({'group': ["it","com","acc"],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df4

  group supervisor
0    it      Carly
1   com      Guido
2   acc      Steve

In [0]:
df3=pd.merge(df1,df2)
df5=pd.merge(df3,df4)
df5

  employee group  hire_date supervisor
0    hafez    it       2004      Carly
1    jabed   com       2008      Guido
2     babe   acc       2012      Steve

In [0]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [0]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [0]:
df.groupby('key').aggregate(['min', np.median, max])

    data
     min median max
key
A      0    1.5   3
B      1    2.5   4
C      2    3.5   5

In [0]:
df.groupby('key').aggregate({'data':'min','data':'max'})

     data
key
A       3
B       4
C       5

In [0]:
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [0]:
df.groupby('key').transform(lambda x: x -x.mean())

   data
0  -1.5
1  -1.5
2  -1.5
3   1.5
4   1.5
5   1.5

In [0]:
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [0]:
df1

  employee group
0    hafez    it
1    jabed   com
2     babe   acc

In [0]:
df

     0  1    2
0  1.0  3  NaN
1  NaN  4  5.0
2  5.0  6  7.0

In [0]:
df.fillna(0)

     0  1    2
0  1.0  3  0.0
1  0.0  4  5.0
2  5.0  6  7.0

In [0]:
df

     0  1    2
0  1.0  3  NaN
1  NaN  4  5.0
2  5.0  6  7.0

In [0]:
df.fillna(method='ffill',axis=0)

     0  1    2
0  1.0  3  NaN
1  1.0  4  5.0
2  5.0  6  7.0

In [0]:
df

     0  1    2
0  1.0  3  NaN
1  NaN  4  5.0
2  5.0  6  7.0

In [0]:
df[0]

0    1.0
1    NaN
2    5.0
Name: 0, dtype: float64

In [0]:
age_array = df[df[1]!=np.nan][1]

In [0]:
df

     0  1    2
0  1.0  3  NaN
1  NaN  4  5.0
2  5.0  6  7.0

In [0]:
df[1].replace(np.nan,age_array.mean())

0    3
1    4
2    6
Name: 1, dtype: int64